{"duration": 1.2162292003631592, "input_args": {"transformer": "TfidfVectorizer()", "X": "array([\"Would the person who is running the e-mail list for KANSAS CITY Royals please\\ne-mail details regarding mailing list. If you on the list and know the info\\nplease send me info as well.\\n\\nPlease e-mail as I don't have time always to read this group\\n\\nJohn\",\n       '\\n\\n\\tThis is the crux of the argument (to me at least).  Both the\\nSDCN and the non-SDCN camps seem to agree on the fact that a catcher\\'s\\ndefense is basically nonmeasurable at present.  You can talk about how\\nimportant calling a game is, or framing the pitches, or blocking balls\\nin the dirt.  But there is little or no way to tell exactly how various\\ncatcher\\'s rank in \"defense\".  \\n\\n\\tLooking at Lopez specifically; is there any reason to suspect\\nthat he is a bad defensive catcher other then the fact that the Braves\\n(or the media) has labeled him a bad defensive catcher?  As far as I\\ncan tell he doesn\\'t have any particular problem in his mechanics\\n(such as Sasser).  He might be a little rough around the edges in blocking\\nthe ball, or framing the pitch to get a good call but all he needs to\\nclear that up is playing and practice time.  I can\\'t see how repetitions\\nat AAA are any better then reps in the majors!  \\n\\n\\tAll we\\'re left with is the calling the game aspect.  Olsen  and\\nBerryhill at always given credit for calling good games and helping\\nthe pitchering staff.  But this is a reputation that is given to almost\\nall veteran catchers.  How is catching at AAA going to help Lopez learn\\nthe major league pitching staff?  The only way any catcher is going to\\nlearn Tom Glavine\\'s pitches is to catch Tom Glavine.  Similarly, I wouldn\\'t\\nbe supprised if the pitcher\\'s claimed to prefer pitching to Olsen over\\npitching to Lopez because they are used to pitching to Olsen.  But \\ngiven time they will say they are comfortable with Lopez.\\n\\n\\tNow, since Lopez can\\'t learn how to handle the major league\\npitcher\\'s while he\\'s in AAA and since he doesn\\'t have any glaring\\nproblem in his mechanics, what is he going to learn in AAA that he\\ncan\\'t learn just as well while in the majors?  ',\n       \"Tuesday's game of Beloved Yakult Swallows\\n\\n(At Jingu, 36,000)\\nHanshin Tigers   001 000 100 |2\\nBeloved Yakult   050 020 00x |7\\n\\nW - Ito (1-0). L - Nakagomi (0-1). HR - Yakult, Arai 1st.\\n------------------------------------------------------------\\nCENTRAL LEAGUE STANDING\\n========================\\n                        W   L   T   Pct.   GB\\nHiroshima Carp          7   1   0   .875   --\\nChunichi  Dragons       6   3   0   .667   1.5\\nHanshin   Tigers        5   4   0   .667   2.5\\nHated     Giants        4   4   0   .500   3.0\\nBeloved   Swallows      3   6   0   .333   4.5\\nYokohama  BayStars      1   8   0   .111   6.5\\n---------------------------------------------------------------\\n\\n\\n--\",\n       ...,\n       'Jonathan E. Quist, on the Thu, 15 Apr 1993 14:26:42 GMT wibbled:\\n\\n: [lots of things, none of which are quoted here]\\n\\n: >>>  You think your *average* dirt biker can jump\\n: >>>a 3 foot log? \\n: >\\n: >How about an 18\" log that is suspended about 18\" off of the ground?\\n: >For that matter, how about a 4\" log that is suspended 2.5\\' off of the\\n: >ground?\\n\\n: Oh, ye of little imagination.\\n\\n:You don\\'t jump over those -that\\'s where you lay the bike down and slide under!\\n: -- \\n: Jonathan E. Quist\\n\\nThe nice thing about horses though, is that if they break down in the middle of\\nnowhere, you can eat them.  Fuel\\'s a bit cheaper, too.\\n--\\n\\nNick (the 90 HP Biker)   DoD 1069   Concise Oxford   Giddy-Up!\\n\\nM\\'Lud.',\n       '\\n\\nAnd most definitely read it in conjunction with Heinlein\\'s _Starship\\nTrooper_.  The two books are radically different viewpoints of the\\nsame basic premises.  I\\'ve even heard tell of English classes built\\naround this.\\n\\n-- \\n\"Insisting on perfect safety is for people who don\\'t have the balls to live\\n in the real world.\"   -- Mary Shafer, NASA Ames Dryden',\n       'I have a program produces a continuous tone by calling XBell\\nrepeatedly at an interval equal to the duration of the bell. If it is\\nrun more than once on a display, the tones are buffered in the X\\nserver and the tone contunues after all occurrences of the program\\nhave exited. Is there a convenient way of preventing this, e.g., by\\nemptying the X server bell buffer when each program exits?\\n- Disclaimer: Please note that the above is a personal view and should not \\n  be construed as an official comment from the JET project.\\n'],\n      dtype=object)", "y": "array(['rec.sport.baseball', 'rec.sport.baseball', 'rec.sport.baseball',\n       ..., 'rec.motorcycles', 'sci.space', 'comp.windows.x'],\n      dtype=object)", "weight": "None", "message_clsname": "'Pipeline'", "message": "None", "params": "{'fit': {}, 'partial_fit': {}, 'predict': {}, 'predict_proba': {}, 'predict_log_proba': {}, 'decision_function': {}, 'score': {}, 'split': {}, 'transform': {}, 'inverse_transform': {}, 'fit_transform': {}, 'fit_predict': {}}"}}