{"duration": 1.1855618953704834, "input_args": {"transformer": "TfidfVectorizer()", "X": "array(['\\n\\nA typical Armenian revisionist. As in the past in x-Soviet Armenia, \\nand today in Azerbaijan, for utopic and idiotic causes the Armenians\\nbrought havoc to their neighbors. A short-sighted and misplaced\\nnationalistic fervor with a wrong agenda and anachronistic methods\\nthe Armenians continue to become pernicious for the region. As usual,\\nthey will be treated accordingly by their neighbors. Nagorno-Karabag \\nis a mountainous enclave that lies completely within Azerbaijan with \\nno border or history whatsoever connected to x-Soviet Armenia. Besides \\nthe geographical aspect, Nagorno-Karabag is the historic homeland and \\nthe \\'cradle\\' of the artistic and literary heritage of Azerbaijan, which \\nrenders the Armenian claims preposterous, even lunatic. No one in his or \\nher mind could have imagined that one day such a devious turn of event \\ncould have plagued the Azeris. One cannot even imagine the reverse case \\nto occur, for the Armenians either would have slaughtered the Azerbaijanis, \\nor put them to forced exile to maintain their own majority. Where was she?\\n\\n\\n                An Appeal to Mankind\\n\\nDuring the last three years Azerbaijan and its multinational\\npopulation are vainly fighting for justice within the limits of\\nthe Soviet Union. All humanitarian, constitutional human rights\\nguaranteed by the UN Charter, Universal Declaration of Human\\nRights, Helsinki Agreements, Human Problems International Forums,\\ndocuments signed by the Soviet Union - all of them are violated.\\n\\nThe USSR\\'s President, government bodies do not defend Azerbaijan\\nthough they are all empowered to take necessary measures to\\nguarantee life and peace.\\n\\nThe 140,000 strong army of Armenian terrorists with Moscow\\'s\\ntacit consent wages an undeclared war of annihilation against\\nAzerbaijan. As a result, a part of Azerbaijan has been occupied\\nand annexed, hundreds of people killed, thousands wounded.\\n\\nSome 200,000 Azerbaijanis have been brutally and inhumanly\\ndeported from the Armenian SSR, their historical homeland.\\nTogether with them 64,000 Russians and 22,000 Kurds have also\\nbeen driven out, a part of them now settled in Azerbaijan.\\nSome 40,000 Turkish-Meskhetians, Lezghins and representatives \\nof other Caucasian nationalities who escaped from the Central\\nAsia where the President and government bodies did not guarantee\\nthem the life and peace also suffered from these deportations.\\n\\nOne of the scandalous vandalisms directed not only against\\nAzerbaijan science but the world civilization as well is the\\nArmenian extremists\\' destruction of the Karabakh scientific\\nexperimental base of The Institute of Genetics and Selection \\nof the Academy of Sciences of the Azerbaijan SSR.\\n\\nWe beg you for humanitarian help and political assistance,\\nfor the honour and dignity of 7 million Azerbaijanis are\\nviolated, its territory, culture  and history are trampled,\\nits people are shot. There is persistent negative image of\\nAzerbaijanians abroad, and this defamation is spread over \\nthe whole world by Soviet mass media, Armenian lobby in the\\nUSSR and the United States. \\n\\nOne of the myths is that all events allegedly involves and\\ngenerated by interethnic collisions and religious intolerance\\nwhile the truth is that all these shootings and recent \\nevents stem from the territorial claims of Armenia on\\nAzerbaijan.\\n\\nIt is a well documented fact that before the conflict there\\nwere no frictions between Armenians and Azerbaijanis on the\\nissue of Karabakh. Hundreds and thousands Armenians placidly\\nand calmly lived and worked in Azerbaijan land, had their\\nrepresentatives in all government bodies of the Azerbaijan\\nSSR.\\n\\nWe are for a united, indivisible, sovereign Azerbaijan, we \\nare for a common Caucasian home proclaimed in 1918 by one\\nof the founding fathers of the Azerbaijan Democratic \\nRepublic - Muhammed Emin Rasulzade.\\n\\nBut all these goals and expectations are trampled upon the\\nSoviet leadership in favour of the Armenian expansionists\\nencouraged by Moscow and intended to create a new \\'1,000\\nYear Reich\\' - the \\'Great Armenia\\' - by annexing the \\nneighboring lands.\\n\\nThe world public opinion shed tears to save the whales,\\nsuffers for penguins dying out in the Antarctic Continent.\\n\\nBut what about the lives of seven million human beings?\\nIf these people are Muslims, does it mean that they are\\nless valuable? Can people be discriminated by their \\ncolour of skin or religion, by their residence or other\\nattributes?\\n\\nAll people are brothers, and we appeal to our brothers\\nfor help and understanding. This is not the first appeal\\nof Azerbaijan to the world public opinion. Our previous\\nappeals were unheard. However, we still carry the hope\\nthat the truth beyond the Russian and Armenian propaganda\\nwill one day reveal the extent of our suffering and\\nstimulate at least as much help and compassion for\\nAzerbaijan as tendered to whales and penguins.\\n\\n\\t\\tTHE COMMITTEE FOR PEOPLE\\'S HELP TO \\n                KARABAKH (OF THE) ACADEMY OF SCIENCES \\n                OF THE AZERBAIJAN SSR\\n\\n\\n\"PAINFUL SEARCH ..\"\\n\\nTHE GRUESOME extent of February\\'s killings of Azeris by Armenians\\nin the town  of Hojali is at last emerging  in Azerbaijan - about\\n600 men,  women and  children dead  in the  worst outrage  of the\\nfour-year war over Nagorny Karabakh.\\n\\nThe figure  is drawn  from Azeri investigators,  Hojali officials\\nand casualty lists published in the Baku press. Diplomats and aid\\nworkers say the death toll is in line with their own estimates.\\n\\nThe 25  February attack on Hojali  by Armenian forces was  one of\\nthe last moves  in their four-year campaign to  take full control\\nof Nagorny Karabakh,  the subject of a new  round of negotiations\\nin Rome on Monday. The bloodshed was something between a fighting\\nretreat and  a massacre, but  investigators say that most  of the\\ndead were civilians. The awful  number of people killed was first\\nsuppressed by  the fearful  former Communist government  in Baku.\\nLater  it  was blurred  by  Armenian  denials and  grief-stricken\\nAzerbaijan\\'s wild  and contradictory  allegations of up  to 2,000\\ndead.\\n\\nThe State Prosecuter, Aydin Rasulov,  the cheif investigator of a\\n15-man  team  looking  into  what Azerbaijan  calls  the  \"Hojali\\nDisaster\", said  his figure of 600  people dead was a  minimum on\\npreliminary  findings.  A similar  estimate  was  given by  Elman\\nMemmedov, the mayor of Hojali. An  even higher one was printed in\\nthe Baku newspaper  Ordu in May - 479 dead  people named and more\\nthan 200 bodies reported unidentified.  This figure of nearly 700\\ndead is quoted as official by Leila Yunusova, the new spokeswoman\\nof the Azeri Ministry of Defence.\\n\\nFranCois Zen  Ruffinen, head  of delegation of  the International\\nRed Cross  in Baku, said  the Muslim imam  of the nearby  city of\\nAgdam had reported a figure of  580 bodies received at his mosque\\nfrom  Hojali, most  of  them  civilians. \"We  did  not count  the\\nbodies. But  the figure seems  reasonable. It is no  fantasy,\" Mr\\nZen Ruffinen said. \"We have some idea since we gave the body bags\\nand products to wash the dead.\"\\n\\nMr  Rasulov endeavours  to give  an unemotional  estimate of  the\\nnumber of  dead in the  massacre. \"Don\\'t  get worked up.  It will\\ntake  several months  to  get a  final  figure,\" the  43-year-old\\nlawyer said at his small office.\\n\\nMr Rasulov  knows about these  things. It  took him two  years to\\nreach  a firm  conclusion that  131  people were  killed and  714\\nwounded  when  Soviet  troops  and tanks  crushed  a  nationalist\\nuprising in Baku in January 1990.\\n\\nThose  nationalists, the  Popular  Front, finally  came to  power\\nthree weeks  ago and  are applying pressure  to find  out exactly\\nwhat  happened when  Hojali, an  Azeri town  which lies  about 70\\nmiles from the border with Armenia, fell to the Armenians.\\n\\nOfficially, 184 people have so  far been certified as dead, being\\nthe  number of  people that  could be  medically examined  by the\\nrepublic\\'s forensic department. \"This  is just a small percentage\\nof the dead,\" said Rafiq Youssifov, the republic\\'s chief forensic\\nscientist. \"They were the only bodies brought to us. Remember the\\nchaos and the fact that we are  Muslims and have to wash and bury\\nour dead within 24 hours.\"\\n\\nOf these 184 people, 51 were women, and 13 were children under 14\\nyears old.  Gunshots killed  151 people,  shrapnel killed  20 and\\naxes or  blunt instruments  killed 10.  Exposure in  the highland\\nsnows killed the last three.  Thirty-three people showed signs of\\ndeliberate mutilation, including ears,  noses, breasts or penises\\ncut off and  eyes gouged out, according  to Professor Youssifov\\'s\\nreport. Those 184 bodies examined were less than a third of those\\nbelieved to have been killed, Mr Rasulov said.\\n\\nFiles  from  Mr  Rasulov\\'s  investigative  commission  are  still\\ndisorganised -  lists of 44  Azeri militiamen are dead  here, six\\npolicemen there,  and in handwriting  of a mosque  attendant, the\\nnames of  111 corpses brought to  be washed in just  one day. The\\nmost heartbreaking account from  850 witnesses interviewed so far\\ncomes  from Towfiq  Manafov,  an Azeri  investigator  who took  a\\nhelicopter  flight  over  the  escape route  from  Hojali  on  27\\nFebruary.\\n\\n\"There were too many bodies of  dead and wounded on the ground to\\ncount properly: 470-500  in Hojali, 650-700 people  by the stream\\nand the road and 85-100  visible around Nakhchivanik village,\" Mr\\nManafov  wrote in  a  statement countersigned  by the  helicopter\\npilot.\\n\\n\"People waved up  to us for help. We saw  three dead children and\\none  two-year-old alive  by  one  dead woman.  The  live one  was\\npulling at her arm for the mother to get up. We tried to land but\\nArmenians started a barrage against  our helicopter and we had to\\nreturn.\"\\n\\nThere  has been  no consolidation  of  the lists  and figures  in\\ncirculation because  of the political  upheavals of the  last few\\nmonths and the  fact that nobody knows exactly who  was in Hojali\\nat the time - many inhabitants were displaced from other villages\\ntaken over by Armenian forces.\\n\\nTHE INDEPENDENT, London, 12/6/\\'92\\n\\n\\nHEROES WHO FOUGHT ON AMID THE BODIES\\n\\nAREF  SADIKOV sat  quietly  in the  shade of  a  cafe-bar on  the\\nCaspian Sea  esplanade of Baku and  showed a line of  stitches in\\nhis trousers, torn  by an Armenian bullet as he  fled the town of\\nHojali just over three months ago, writes Hugh Pope.\\n\\n\"I\\'m still  wearing the same  clothes, I don\\'t have  any others,\"\\nthe  51-year-old carpenter  said,  beginning his  account of  the\\nHojali disaster. \"I was wounded in five places, but I am lucky to\\nbe alive.\"\\n\\nMr Sadikov and  his wife were short of  food, without electricity\\nfor more than a month, and cut off from helicopter flights for 12\\ndays. They  sensed the  Armenian noose was tightening  around the\\n2,000 to  3,000 people left in  the straggling Azeri town  on the\\nedge of Karabakh.\\n\\n\"At about 11pm  a bombardment started such as we  had never heard\\nbefore,  eight  or  nine   kinds  of  weapons,  artillery,  heavy\\nmachine-guns, the lot,\" Mr Sadikov said.\\n\\nSoon neighbours were  pouring down the street  from the direction\\nof  the  attack. Some  huddled  in  shelters but  others  started\\nfleeing the town,  down a hill, through a stream  and through the\\nsnow into a forest on the other side.\\n\\nTo escape, the  townspeople had to reach the Azeri  town of Agdam\\nabout 15  miles away. They  thought they  were going to  make it,\\nuntil at  about dawn  they reached a  bottleneck between  the two\\nArmenian villages of Nakhchivanik and Saderak.\\n\\n\"None of my group was hurt up to then ... Then we were spotted by\\na  car on  the road,  and the  Armenian outposts  started opening\\nfire,\" Mr Sadikov said.\\n\\nAzeri militiamen fighting their way  out of Hojali rushed forward\\nto force  open a  corridor for the  civilians, but  their efforts\\nwere mostly  in vain.  Mr Sadikov  said only  10 people  from his\\ngroup of  80 made it  through, including his wife  and militiaman\\nson.  Seven  of  his  immediate  relations  died,  including  his\\n67-year-old elder brother.\\n\\n\"I only had time to reach down  and cover his face with his hat,\"\\nhe said, pulling his own big  flat Turkish cap over his eyes. \"We\\nhave never got any of the bodies back.\"\\n\\nThe first groups were lucky to have the benefit of covering fire.\\nOne hero  of the  evacuation, Alif  Hajief, was  shot dead  as he\\nstruggled to change  a magazine while covering  the third group\\'s\\ncrossing, Mr Sadikov said.\\n\\nAnother hero,  Elman Memmedov, the  mayor of Hojali, said  he and\\nseveral others  spent the whole day  of 26 February in  the bushy\\nhillside, surrounded by  dead bodies as they tried  to keep three\\nArmenian armoured personnel carriers at bay.\\n\\nAs the  survivors staggered the  last mile into Agdam,  there was\\nlittle comfort  in a town from  which most of the  population was\\nsoon to flee.\\n\\n\"The night  after we reached  the town  there was a  big Armenian\\nrocket attack. Some people just  kept going,\" Mr Sadikov said. \"I\\nhad to  get to the  hospital for treatment. I  was in a  bad way.\\nThey even found a bullet in my sock.\"\\n\\nVictims of  war: An  Azeri woman  mourns her  son, killed  in the\\nHojali massacre in February  (left). Nurses struggle in primitive\\nconditions  (centre)  to  save  a  wounded  man  in  a  makeshift\\noperating  theatre set  up  in a  train carriage.  Grief-stricken\\nrelatives in  the town of Agdam  (right) weep over the  coffin of\\nanother of the massacre victims. Calculating the final death toll\\nhas been  complicated because Muslims  bury their dead  within 24\\nhours.\\n\\nPhotographs: Liu Heung / AP\\n             Frederique Lengaigne / Reuter\\n\\nTHE INDEPENDENT, London, 12/6/\\'92\\n\\nSerdar Argic',\n       \"Hi, I'm new to Internet, so this is a bit of a test message, so even a \\ntoken reply would be very appreciated.\",\n       'I hate to be the burden of bad news, but I think I will this time!  =)\\n\\nThe Phillies usually play at either 7:05 P.M. or 7:35 P.M. Eastern Time for\\nweekdays.  On Sundays the time is usually 1:35 P.M. Eastern Time.\\n\\nBoise is in Idaho.  Idaho is in part of the Mountain Time Zone and in part\\nof the Pacific Time Zone.  The times that were given were for Mountain Time\\nZone starts.\\n\\nPlease check a map in case I am wrong.  But I am certain that Boise is in the\\nMountain Time Zone.\\n\\n\\nThanks for listening!\\n',\n       ...,\n       \"   After hearing endless debate (READ: name-calling) over which os is better, dos\\n   and windows or OS/2 and finally having enought resourses to play with a couple\\n   of different operating systems, I have decided to put the two products to a\\n   head to head test, as so many fellow newsposters have suggested.  I have, \\n   however, no desire whatsoever to use a version of os/2 which wont REALLY\\n   do what it says (i.e. run windows apps)  OS/2 2.0-2.1 will not run windows\\n   apps in 386 enhansed mode, something that most larger windows apps require, but\\n   OS/2 2.2, which is supposed to be in beta test, is supposed to.  I have heard\\n   that os/2 2.2 beta is available via ftp, and I was wondering if anyone knew\\n   where to obtain a copy.  I would appreciate any information, as I would like, \\n   once and for all, to establish for myself which is the best os for my needs.\\n\\n   ->Robbie<-\\n   z_shererrg.sfasu.edu\\n\\nIf you wait until May the 18th you will be able to buy the new OS/2\\n2.1 since it will be released at Comdex that day. It will run Windows\\n3.1 apps and Windows enh. mode. If you can't wait, then you can ftp a\\n6 months old beta version from ftp-os2.nmsu.edu, but this version is\\nprobably a lot slower than the final product.\\n\\nWhen you do your test, please have in mind that a single tasking\\nsystem will always be faster at doing one task. The real power of OS2\\nlies in the multitasking and can't really be measured by a stopwatch.\\n\\nHappy benchmarking.\\nHans\\n--\\n------------------------------------------------------------- \\nThe whales of the Atlantic and the people of the Faroe Islands \\nhave coexisted in perfect harmony for the last 1000 years -\\nno matter what any urban navel contamplator without any real\\nrelation to the coherence of the nature says.\",\n       \"Hello,\\n  \\n  I'm investigating the purchase of an Object Oriented Application Framework.  I have\\ncome across a few that look good:\\n\\n  Zapp 1.1 from Inmark\\n  Zinc 3.5 from Zinc software\\n  C++/Views from Liant\\n  Win++ from Blaise\\n\\nSome considerations I'm using:\\n\\n  Being new to Windows programming (I'm from the UNIX/X world), the quality and\\nintuitivness of the abstraction that these class libraries provide is very \\nimportant.  However, since I'm not adverse to learning the internals of Windows\\nprogramming, the new programming methodology should be closely aligned with\\nthe native one.  I don't believe arbitrary levels of abstraction, just for the\\nsake of changing the API, are valuable.\\n\\n  Since we will be developing for the 32bit Windows NT system the\\nmemory management issues and issues particular to the Windows 3.1 API are less\\nimportant. \\n\\n  We will probably buy another C++ class library (something like Tools.h++ or Booch\\ncomponents from Rational) to handle data structures and other miscellaneous stuff\\n (allocators etc...).  So those features are not that important for this toolkit to have.\\n\\nThe two that I have narrowed it down to are ZApp and Zinc, they seem to be the two\\ntoolkits that have received the most attention from the media.  I was wondering if\\nanyone had any first-hand experience with any of these toolkits (especially ZApp and Zinc).\\n\\nA couple of observations about these toolkits that seem particularly noteworthy are:\\n\\nZApp\\n----\\n  Seems to have the most extensive coverage of Windows functionality and\\n    also includes some other miscellaneous useful classes.\\n  Has new fancy 3D-style controls available, and support for custom controls.\\n  Has a Windows NT version (Essential)\\n  Redirectable graphics display/output architecture (useful for printing)\\n  Sizer class for automatically managing control layout after resize.\\n  Seems to be the newcomer, this could be an advantage in designing a better system.\\n \\nZinc\\n----\\n  Has a platform independent resource strategy.  (Not too important for me right now)\\n  Comes with a interface builder tool\\n  Has a Windows NT version (Essential)\\n  Seems to have been around longer (more mature), but grew up out of a DOS version.  \\n  Had a better demo :-)\\n\\nBoth have source code availability options\\nBoth are lacking OLE support\\nNeither seem to have any particular support for multimedia type stuff\\n\\n\\nAny thoughts anyone has on this would be much appreciated,\\n\\nThanks,\\n  Brett Harper\\n\",\n       'Ok, so if everyone is cheating.. is there any tests that run some \\nmacro (to load a huge drawing, etc...) on the SAME machine that might \\nthen tell us what the REAL world results are?\\n\\nI mean, run the tests on the same machine with different video cards\\nrunning word, excel, or something like that to see how fast the cards are?\\n\\n-- \\n----------------------------------------------------------------------------\\nswyatt@brahms.udel.edu  !!! no disclaimer...I blame everything on someone else '],\n      dtype=object)", "y": "array(['talk.politics.mideast', 'sci.crypt', 'rec.sport.baseball', ...,\n       'comp.os.ms-windows.misc', 'comp.os.ms-windows.misc',\n       'comp.os.ms-windows.misc'], dtype=object)", "weight": "None", "message_clsname": "'Pipeline'", "message": "None", "params": "{'fit': {}, 'partial_fit': {}, 'predict': {}, 'predict_proba': {}, 'predict_log_proba': {}, 'decision_function': {}, 'score': {}, 'split': {}, 'transform': {}, 'inverse_transform': {}, 'fit_transform': {}, 'fit_predict': {}}"}}